chipsoft/doip/hw/same54/drivers/bsp_ethernet.c
    printf("[ETH] Initializing GMAC clocks and pins\r\n");
    
    // Initialize GMAC clocks first
    gmac_clock_init();
    
    // Configure GMAC pins
    gmac_pin_init();
    
    // Initialize MAC
    int32_t result = mac_async_init(context->mac_desc, GMAC);
    if (result != ERR_NONE) {
        return convert_error_code(result);
    }
    
    printf("[ETH] MAC initialized successfully\r\n");
    return DRV_ETH_STATUS_OK;
}

static drv_eth_status_t drv_eth_deinit(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    const drv_eth_hw_context_t *context = (const drv_eth_hw_context_t *)hw_context;
    
    int32_t result = mac_async_deinit(context->mac_desc);
    printf("[ETH] MAC deinitialized\r\n");
    return convert_error_code(result);
}

static drv_eth_status_t drv_eth_enable(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    const drv_eth_hw_context_t *context = (const drv_eth_hw_context_t *)hw_context;
    
    int32_t result = mac_async_enable(context->mac_desc);
    if (result == ERR_NONE) {
        printf("[ETH] MAC enabled\r\n");
    }
    return convert_error_code(result);
}

static drv_eth_status_t drv_eth_disable(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    const drv_eth_hw_context_t *context = (const drv_eth_hw_context_t *)hw_context;
    
    int32_t result = mac_async_disable(context->mac_desc);
    printf("[ETH] MAC disabled\r\n");
    return convert_error_code(result);
}

static drv_eth_status_t drv_eth_phy_init(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    const drv_eth_hw_context_t *context = (const drv_eth_hw_context_t *)hw_context;
    
    // Initialize PHY
    int32_t result = ethernet_phy_init(context->phy_desc, context->mac_desc, context->phy_address);
    if (result != ERR_NONE) {
        return convert_error_code(result);
    }
    
    printf("[ETH] PHY initialized at address %d\r\n", context->phy_address);
    
#if CONF_ETHERNET_PHY_0_IEEE8023_MII_CONTROL_REG0_SETTING == 1
    printf("[ETH] Writing PHY control register: 0x%04X\r\n", CONF_ETHERNET_PHY_0_IEEE8023_MII_CONTROL_REG0);
    result = ethernet_phy_write_reg(context->phy_desc, MDIO_REG0_BMCR, CONF_ETHERNET_PHY_0_IEEE8023_MII_CONTROL_REG0);
    if (result != ERR_NONE) {
        return convert_error_code(result);
    }
#endif
    
    printf("[ETH] PHY initialized, auto-negotiation will start naturally\r\n");
    
    // Read and display PHY registers for debugging
    uint16_t reg_value;
    if (ethernet_phy_read_reg(context->phy_desc, 0, &reg_value) == ERR_NONE) {
        printf("[ETH] PHY Control Register (0): 0x%04X\r\n", reg_value);
    }
    if (ethernet_phy_read_reg(context->phy_desc, 1, &reg_value) == ERR_NONE) {
        printf("[ETH] PHY Status Register (1): 0x%04X\r\n", reg_value);
    }
    if (ethernet_phy_read_reg(context->phy_desc, 4, &reg_value) == ERR_NONE) {
        printf("[ETH] PHY Auto-Negotiation Advertisement (4): 0x%04X\r\n", reg_value);
    }
    
    return DRV_ETH_STATUS_OK;
}

static drv_eth_status_t drv_eth_phy_reset(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    const drv_eth_hw_context_t *context = (const drv_eth_hw_context_t *)hw_context;
    
    int32_t result = ethernet_phy_reset(context->phy_desc);
    if (result == ERR_NONE) {
        printf("[ETH] PHY reset completed\r\n");
    }
    return convert_error_code(result);
}

static drv_eth_status_t drv_eth_get_link_status(const void *hw_context, bool *link_up)
{
    ASSERT(hw_context != NULL);
    ASSERT(link_up != NULL);
    const drv_eth_hw_context_t *context = (const drv_eth_hw_context_t *)hw_context;
    
    int32_t result = ethernet_phy_get_link_status(context->phy_desc, link_up);
    return convert_error_code(result);
}

static drv_eth_status_t drv_eth_restart_autoneg(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    const drv_eth_hw_context_t *context = (const drv_eth_hw_context_t *)hw_context;
    
    int32_t result = ethernet_phy_restart_autoneg(context->phy_desc);
    if (result == ERR_NONE) {
        printf("[ETH] Auto-negotiation restarted\r\n");
    }
    return convert_error_code(result);
}

static drv_eth_status_t drv_eth_read_phy_reg(const void *hw_context, uint16_t reg, uint16_t *value)
{
    ASSERT(hw_context != NULL);
    ASSERT(value != NULL);
    const drv_eth_hw_context_t *context = (const drv_eth_hw_context_t *)hw_context;
    
    int32_t result = ethernet_phy_read_reg(context->phy_desc, reg, value);
    return convert_error_code(result);
}

static drv_eth_status_t drv_eth_write_phy_reg(const void *hw_context, uint16_t reg, uint16_t value)
{
    ASSERT(hw_context != NULL);
    const drv_eth_hw_context_t *context = (const drv_eth_hw_context_t *)hw_context;
    
    int32_t result = ethernet_phy_write_reg(context->phy_desc, reg, value);
    return convert_error_code(result);
}

static drv_eth_status_t drv_eth_register_callback(const void *hw_context, drv_eth_cb_type_t type, drv_eth_callback_t callback)
{
    ASSERT(hw_context != NULL);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
    // Store callback for future use
    if (type == DRV_ETH_CB_RECEIVE) {
        context->receive_callback = callback;
        // Register with ASF4 MAC
        int32_t result = mac_async_register_callback(context->mac_desc, MAC_ASYNC_RECEIVE_CB, (FUNC_PTR)callback);
        return convert_error_code(result);
    } else if (type == DRV_ETH_CB_TRANSMIT) {
        context->transmit_callback = callback;
        // Register with ASF4 MAC  
        int32_t result = mac_async_register_callback(context->mac_desc, MAC_ASYNC_TRANSMIT_CB, (FUNC_PTR)callback);
        return convert_error_code(result);
    }
    
    return DRV_ETH_STATUS_ERROR;
}

static drv_eth_status_t drv_eth_write(const void *hw_context, const uint8_t *data, uint32_t length)
{
    ASSERT(hw_context != NULL);
    ASSERT(data != NULL);
    const drv_eth_hw_context_t *context = (const drv_eth_hw_context_t *)hw_context;
    
    int32_t result = mac_async_write(context->mac_desc, (uint8_t *)data, length);
    return convert_error_code(result);
}

/* GMAC hardware initialization functions */

static void gmac_clock_init(void)
{
    hri_mclk_set_AHBMASK_GMAC_bit(MCLK);
    hri_mclk_set_APBCMASK_GMAC_bit(MCLK);
    printf("[ETH] GMAC clocks enabled\r\n");
}

static void gmac_pin_init(void)
{
    gpio_set_pin_function(PC11, PINMUX_PC11L_GMAC_GMDC);
    gpio_set_pin_function(PC12, PINMUX_PC12L_GMAC_GMDIO);
    gpio_set_pin_function(PA13, PINMUX_PA13L_GMAC_GRX0);
    gpio_set_pin_function(PA12, PINMUX_PA12L_GMAC_GRX1);
    gpio_set_pin_function(PC20, PINMUX_PC20L_GMAC_GRXDV);
    gpio_set_pin_function(PA15, PINMUX_PA15L_GMAC_GRXER);
    gpio_set_pin_function(PA18, PINMUX_PA18L_GMAC_GTX0);
    gpio_set_pin_function(PA19, PINMUX_PA19L_GMAC_GTX1);
    gpio_set_pin_function(PA14, PINMUX_PA14L_GMAC_GTXCK);
    gpio_set_pin_function(PA17, PINMUX_PA17L_GMAC_GTXEN);
    printf("[ETH] GMAC pins configured\r\n");
}

/* GMAC and link monitoring functions moved from webserver_tasks.c */

static void mac_receive_cb(struct mac_async_descriptor *desc)
{
    drv_eth_hw_context_t *context = &drv_eth_hw_context_communication;
    context->recv_flag = true;
}

/**
 * \brief Callback for GMAC interrupt.
 * Give semaphore for which gmac_task waits
 */
static void gmac_handler_cb(void)
{
    drv_eth_hw_context_t *context = &drv_eth_hw_context_communication;
    BaseType_t xGMACTaskWoken = pdFALSE;
    
    /* Use ISR-safe semaphore give function */
    xSemaphoreGiveFromISR(context->gmac_dev.rx_sem.sem, &xGMACTaskWoken);
    
