chipsoft/doip/hw/same54/drivers/bsp_ethernet.c
    /* Perform context switch if higher priority task was woken */
    portYIELD_FROM_ISR(xGMACTaskWoken);
}

/**
 * \brief Task for GMAC.
 * Waits for GMAC interrupt and begins processing of received packets
 */
static void gmac_task(void *pvParameters)
{
    gmac_device *ps_gmac_dev = pvParameters;

    while (1) {
        /* Wait for the counting RX notification semaphore. */
        sys_sem_wait(&ps_gmac_dev->rx_sem);

        /* Process the incoming packet. */
        ethernetif_mac_input(ps_gmac_dev->netif);
    }
}

/**
 * \brief Link monitoring task
 * Periodically checks PHY link status and notifies lwIP of changes
 */
static void link_monitor_task(void *p)
{
    (void)p;
    drv_eth_hw_context_t *context = &drv_eth_hw_context_communication;
    bool current_link_state = false;
    bool previous_link_state = false;
    
    /* Wait for network initialization to complete */
    vTaskDelay(2000);
    
    /* Get initial link state */
    hw_eth_get_link_status(&eth_communication, &previous_link_state);
    
    for (;;) {
        /* Check current link status */
        drv_eth_status_t phy_result = hw_eth_get_link_status(&eth_communication, &current_link_state);
        if (phy_result == DRV_ETH_STATUS_OK) {
            /* Detect link status changes */
            if (current_link_state != previous_link_state) {
                printf("[LINK_MONITOR] Link state change detected: %s -> %s\r\n",
                       previous_link_state ? "UP" : "DOWN",
                       current_link_state ? "UP" : "DOWN");
                
                /* Update lwIP network interface link status */
                if (current_link_state) {
                    netif_set_link_up(&TCPIP_STACK_INTERFACE_0_desc);
                    printf("[LINK_MONITOR] Notified lwIP: Link UP\r\n");
                    
                    /* Don't restart auto-negotiation - let it stabilize naturally */
                    printf("[LINK_MONITOR] Link UP - allowing stabilization\r\n");
                } else {
                    netif_set_link_down(&TCPIP_STACK_INTERFACE_0_desc);
                    printf("[LINK_MONITOR] Notified lwIP: Link DOWN\r\n");
                }
                
                /* Update context link state */
                context->link_up = current_link_state;
                previous_link_state = current_link_state;
            }
        } else {
            printf("[LINK_MONITOR] Failed to read PHY link status (error: %d)\r\n", phy_result);
            
            /* Try to reinitialize PHY if we can't read it */
            static int phy_error_count = 0;
            phy_error_count++;
            if (phy_error_count >= 10) {  /* After 10 consecutive errors (5 seconds) */
                printf("[LINK_MONITOR] Attempting PHY re-initialization\r\n");
                hw_eth_phy_init(&eth_communication);
                phy_error_count = 0;
            }
        }
        
        /* Check link status every 500ms */
        vTaskDelay(500);
    }
}

/* TCP/IP stack initialization done callback - moved from webserver_tasks.c */
static void eth_tcpip_init_done(void *arg)
{
    sys_sem_t *sem;
    sem = (sys_sem_t *)arg;
    u8_t mac[6] = {0x00, 0x00, 0x00, 0x00, 0x20, 0x76};
    
    /* Initialize network event logging */
    network_events_init();
    log_lwip_init(ERR_OK);
    
    hw_eth_register_callback(&eth_communication, DRV_ETH_CB_RECEIVE, gmac_handler_cb);
    hri_gmac_set_IMR_RCOMP_bit(COMMUNICATION_IO.dev.hw);

    printf("[INIT] Waiting for Ethernet link...\r\n");
    
    /* Initialize PHY before reading its status */
    drv_eth_status_t phy_init_status = hw_eth_phy_init(&eth_communication);
    if (phy_init_status != DRV_ETH_STATUS_OK) {
        printf("[INIT] PHY initialization failed: %d\r\n", phy_init_status);
    }
    
    /* Give PHY more time to initialize and establish link */
    int link_attempts = 0;
    const int max_link_attempts = 100;  /* 10 seconds at 100ms intervals */
    
    drv_eth_hw_context_t *context = &drv_eth_hw_context_communication;
    
    while (link_attempts < max_link_attempts) {
        drv_eth_status_t phy_status = hw_eth_get_link_status(&eth_communication, &context->link_up);
        
        if (phy_status == DRV_ETH_STATUS_OK && context->link_up) {
            printf("[INIT] PHY link established after %d attempts\r\n", link_attempts);
            break;
        }
        
        if (phy_status != DRV_ETH_STATUS_OK) {
            printf("[INIT] PHY read error: %d (attempt %d)\r\n", phy_status, link_attempts);
        } else {
            printf("[INIT] PHY link still down (attempt %d)\r\n", link_attempts);
        }
        
        link_attempts++;
        vTaskDelay(100);  /* Wait 100ms between attempts */
    }
    
    if (!context->link_up) {
        printf("[INIT] WARNING: PHY link not established after %d attempts\r\n", max_link_attempts);
        printf("[INIT] Continuing with network stack initialization...\r\n");
    }

    printf("[INIT] Ethernet link detected\r\n");

    /* Enable NVIC GMAC interrupt. */
    /* Interrupt priorities. (lowest value = highest priority) */
    /* ISRs using FreeRTOS *FromISR APIs must have priorities below or equal to */
    /* configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY. */
    /* Setting to 5 (numerically higher than 4, so lower priority) */
    NVIC_SetPriority(GMAC_IRQn, 5);
    NVIC_EnableIRQ(GMAC_IRQn);
    mac_async_enable(&COMMUNICATION_IO);

    printf("[INIT] Initializing network interface...\r\n");
    TCPIP_STACK_INTERFACE_0_init(mac);

    TCPIP_STACK_INTERFACE_0_desc.input = tcpip_input;

    context->gmac_dev.netif = &TCPIP_STACK_INTERFACE_0_desc;

    /* Incoming packet notification semaphore. */
    if (sys_sem_new(&context->gmac_dev.rx_sem, 0) != ERR_OK) {
        LWIP_ASSERT("Failed to create semaphore", 0);
    }

    sys_thread_t id = sys_thread_new("GMAC", gmac_task, &context->gmac_dev, netifINTERFACE_TASK_STACK_SIZE, netifINTERFACE_TASK_PRIORITY);
    LWIP_ASSERT("ethernetif_init: GMAC Task allocation ERROR!\n", (id != 0));
    (void)id;  /* Suppress unused variable warning after assertion */

    printf("[INIT] Setting up network interface callbacks...\r\n");
    netif_set_default(&TCPIP_STACK_INTERFACE_0_desc);
    
