chipsoft/doip/hw/same54/drivers/bsp_ethernet.c
    /* Register network event callbacks */
    netif_set_status_callback(&TCPIP_STACK_INTERFACE_0_desc, netif_status_callback);
    netif_set_link_callback(&TCPIP_STACK_INTERFACE_0_desc, netif_link_callback);
    
    /* Log initial MAC address */
    log_mac_address(&TCPIP_STACK_INTERFACE_0_desc);
    
    /* Log initial link status */
    log_link_status_change(&TCPIP_STACK_INTERFACE_0_desc, context->link_up);
    
    /* Manually update lwIP link status since link monitoring task hasn't started yet */
    if (context->link_up) {
        printf("[INIT] Setting initial link status to UP in lwIP\r\n");
        netif_set_link_up(&TCPIP_STACK_INTERFACE_0_desc);
    } else {
        printf("[INIT] Setting initial link status to DOWN in lwIP\r\n");
        netif_set_link_down(&TCPIP_STACK_INTERFACE_0_desc);
    }

#if CONF_TCPIP_STACK_INTERFACE_0_DHCP
    /* DHCP mode. */
    printf("[INIT] Starting DHCP client...\r\n");
    if (ERR_OK != dhcp_start(&TCPIP_STACK_INTERFACE_0_desc)) {
        log_dhcp_error(&TCPIP_STACK_INTERFACE_0_desc, "Failed to start DHCP client");
        LWIP_ASSERT("ERR_OK != dhcp_start", 0);
    } else {
        printf("[DHCP] Client started successfully\r\n");
    }
#else
    printf("[INIT] Using static IP configuration...\r\n");
    netif_set_up(&TCPIP_STACK_INTERFACE_0_desc);
    log_network_config(&TCPIP_STACK_INTERFACE_0_desc);
#endif

    printf("[INIT] Network initialization complete\r\n");
    sys_sem_signal(sem); /* Signal the waiting thread that the TCP/IP init is done. */
}

static drv_eth_tcpip_init_done_fn drv_eth_get_tcpip_init_done_fn_impl(const void *hw_context)
{
    return eth_tcpip_init_done;
}

/**
 * \brief Start link monitoring task
 */
static drv_eth_status_t drv_eth_start_link_monitor_impl(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
    if (context->link_monitor_task != NULL) {
        printf("[ETH] Link monitor task already running\r\n");
        return DRV_ETH_STATUS_OK;
    }
    
    /* Create task to monitor link status */
    if (xTaskCreate(link_monitor_task, "LinkMon", TASK_LED_STACK_SIZE, NULL, TASK_LED_TASK_PRIORITY, &context->link_monitor_task) != pdPASS) {
        printf("[ETH] Failed to create link monitor task\r\n");
        return DRV_ETH_STATUS_ERROR;
    }
    
    printf("[ETH] Link monitor task started\r\n");
    return DRV_ETH_STATUS_OK;
}

/**
 * \brief Stop link monitoring task
 */
static drv_eth_status_t drv_eth_stop_link_monitor_impl(const void *hw_context)
{
    ASSERT(hw_context != NULL);
    drv_eth_hw_context_t *context = (drv_eth_hw_context_t *)hw_context;
    
    if (context->link_monitor_task != NULL) {
        vTaskDelete(context->link_monitor_task);
        context->link_monitor_task = NULL;
        printf("[ETH] Link monitor task stopped\r\n");
    }
    
    return DRV_ETH_STATUS_OK;
}